# Задача 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.

# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# n = (int(input('Введите размерность списка n: ')))
# list_num = []
# for i in range(n):
#     list_num.append(int(input(f'Ведите элемент списка с номером индекса {i} : ')))
# print(f'list_num = {list_num}')

# summa = 0
# for j in range(1, n, 2):
#     summa += list_num[j]
# print(summa)

# ========================================================================================================
# 
# Задача 2. Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и 
# последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# n = (int(input('Введите размерность списка n: ')))
# list_num = []
# for i in range(n):
#     list_num.append(int(input(f'Ведите элемент списка с номером индекса {i} : ')))
# print(f'list_num = {list_num}')

# j = 0
# k = len(list_num) -1 
# list_product =[]
# while j <= k:
#     list_product.append(list_num[j] * list_num[k])
#     j += 1
#     k -= 1
# print(list_product)

# ==========================================================================================================
# 
# Задача 3. Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между 
# максимальным и минимальным значением дробной части элементов.

# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# n = (int(input('Введите размерность списка n: ')))
# list_num = []
# for i in range(n):
#     list_num.append(float(input(f'Ведите элемент списка с номером индекса {i} : ')))
# print(f'list_num = {list_num}')
# num = []
# for i in range(len(list_num)):
#     num.append(list_num[i] - int(list_num[i]))

# min_el = min(num)
# max_el = max(num)
# result = round((max_el - min_el), 2)
# print(f'Разность между максимальным и минимальным значением дробной части: {result}')

# =============================================================================================================
#
#  Задача 4. Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
# 
# dec = int(input('Введите целое положительное число: '))
# if dec > 0:
#     bin = ''
#     while dec > 0:
#         bin = str(dec % 2) + bin
#         dec //= 2
#     print(bin)
# else:
#     print('Ошибка! Введите положительное чило')#

# ==========================================================================================================
# 
# Задача 5. Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:

# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]


# def fib(n):
#     list_fib = []
#     f1, f2 = 1, 1
#     for i in range(n):
#         list_fib.append(f1)
#         f1, f2 = f2, f1 + f2
#     f1, f2 = 0, 1
#     for i in range(n + 1):
#         list_fib.insert(0, f1)
#         f1, f2 = f2, f1 - f2
#     return list_fib


# n = int(input('Введите число n: '))
# print(fib(n))

















